MatthiasPetermann/netbsd-src/usr.sbin/jailmgr/jailmgr.8
." $NetBSD$
.Dd February 8, 2026
.Dt JAILMGR 8
.Os
.Sh NAME
.Nm jailmgr
.Nd provision and manage multiple jailctl jails from one configuration
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar args ...
.Sh DESCRIPTION
The
.Nm
utility is a shell-script helper around
.Xr jailctl 8
for provisioning and operating multiple jails.
It is designed for setups that use:
.Bl -bullet -compact
.It
a shared, read-only base filesystem extracted from
.Pa base.tgz ,
.It
per-jail writable directories for
.Pa /etc ,
.Pa /var ,
.Pa /tmp ,
and
.Pa /home ,
and
.It
IP-based jail naming and lifecycle management via
.Xr jailctl 8 .
.El
.Pp
By default,
.Nm
reads configuration from
.Pa /etc/jailmgr.conf .
A different configuration file can be selected with the
.Ev JAILMGR_CONF
environment variable.
.Pp
Most commands require superuser privileges.
.Sh COMMANDS
The following commands are supported:
.Bl -tag -width "prepare-jail name ip"
.It Cm fetch-sets
Download
.Pa base.tgz
and
.Pa etc.tgz
from
.Ev NETBSD_MIRROR
into the configured release directory.
.It Cm build-base
Extract
.Pa base.tgz
into the configured shared base layer directory.
.It Cm prepare-jail Ar name Ar ip
Create directories and metadata for one jail:
.Pa root ,
.Pa etc ,
.Pa var ,
.Pa tmp ,
and
.Pa home .
If necessary,
.Pa etc.tgz
is extracted into the jail-local
.Pa etc
copy.
.It Cm prepare-all
Run
.Cm prepare-jail
for all entries in
.Ev JAIL_LIST .
.It Cm host-net-up
Add host-side IPv4 aliases for all jail addresses in
.Ev JAIL_LIST
on interface
.Ev JAIL_HOST_IF .
.It Cm host-net-down
Remove those host-side IPv4 aliases.
.It Cm start-jail Ar name Ar ip
Mount the composed jail root and start the jail with
.Xr jailctl 8 .
.It Cm start-all
Run
.Cm host-net-up
and then start all jails in
.Ev JAIL_LIST .
.It Cm stop-jail Ar name
Destroy one jail by name through
.Xr jailctl 8
and unmount its root composition.
.It Cm stop-all
Stop and unmount all jails listed in
.Ev JAIL_LIST .
.It Cm npf-sync
Generate (or update) an NPF redirection snippet from
.Ev NPF_RDR_LIST
and write it to
.Ev NPF_CONF_SNIPPET .
If
.Ev NPF_AUTO_RELOAD
is
.Dq YES ,
reload NPF after writing the snippet.
.It Cm status
Show
.Xr jailctl 8
status and mount status for all configured jails.
.It Cm gen-rc Op Ar path
Emit an
.Xr rc.d 8
wrapper script.
If
.Ar path
is omitted,
.Pa /etc/rc.d/jailmgr
is used.
.El
.Sh CONFIGURATION
.Nm
accepts shell-style variable assignments in
.Pa /etc/jailmgr.conf
(or the file referenced by
.Ev JAILMGR_CONF ) .
.Pp
Important variables:
.Bl -tag -width "NPF_CONF_SNIPPET"
.It Ev RELEASE
NetBSD release used for set download paths.
.It Ev MACHINE_ARCH
Machine architecture used for set download paths.
.It Ev NETBSD_MIRROR
Base URL for set downloads.
.It Ev JAIL_BASE_DIR
Directory containing extracted shared base layers.
.It Ev JAIL_DATA_DIR
Directory containing per-jail writable state.
.It Ev JAIL_RELEASE_DIR
Directory containing downloaded set archives.
.It Ev JAIL_LIST
Whitespace-separated list of
.Dq name:IPv4
entries.
.It Ev JAIL_DEFAULT_USER
User account to ensure exists inside each prepared jail.
.It Ev JAIL_HOST_IF
Host interface for alias management (commonly
.Dq lo0 ) .
.It Ev NPF_ENABLE
Enable NPF integration when set to
.Dq YES .
.It Ev NPF_EXT_IF
External interface name used in generated
.Nm npf-sync
rules.
.It Ev NPF_CONF_SNIPPET
Path of generated NPF rule snippet.
.It Ev NPF_AUTO_RELOAD
Reload NPF after snippet updates when set to
.Dq YES .
.It Ev NPF_RDR_LIST
Whitespace-separated list of
.Dq name:host_port:jail_port
forwarding entries.
.El
.Sh FILES
.Bl -tag -width "/usr/share/examples/jailmgr/jailmgr.conf.sample"
.It Pa /etc/jailmgr.conf
Default configuration file.
.It Pa /usr/share/examples/jailmgr/jailmgr.conf.sample
Sample configuration file.
.It Pa /usr/share/examples/jailmgr/README
Operational notes and quick-start guidance.
.El
.Sh EXAMPLES
Prepare and start all configured jails:
.Bd -literal -offset indent
# cp /usr/share/examples/jailmgr/jailmgr.conf.sample /etc/jailmgr.conf
# vi /etc/jailmgr.conf
# jailmgr fetch-sets
# jailmgr build-base
# jailmgr prepare-all
# jailmgr start-all
.Ed
.Pp
Generate NPF rules for configured port forwards:
.Bd -literal -offset indent
# jailmgr npf-sync
# echo "include \"/etc/npf-jailmgr.conf\"" >> /etc/npf.conf
# npfctl reload
.Ed
.Sh SEE ALSO
.Xr jailctl 8 ,
.Xr mount_null 8 ,
.Xr npf.conf 5 ,
.Xr rc.d 8
.Sh HISTORY
The
.Nm
script appeared in
.Nx 10.0 .
This manual page was expanded when
.Nm
was moved to its own
.Pa usr.sbin/jailmgr
subdirectory.
