MatthiasPetermann/netbsd-src/usr.sbin/jailmgr/jailmgr.8
." $NetBSD$
.Dd February 13, 2026
.Dt JAILMGR 8
.Os
.Sh NAME
.Nm jailmgr
.Nd provision and manage multiple jailctl jails from one configuration
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar args ...
.Sh DESCRIPTION
The
.Nm
utility is a shell-script helper around
.Xr jailctl 8
for provisioning and operating multiple jails.
It is designed for setups that use:
.Bl -bullet -compact
.It
a shared, read-only base filesystem extracted from
.Pa base.tar.xz ,
.It
per-jail writable directories for
.Pa /etc ,
.Pa /var ,
.Pa /tmp ,
.Pa /home ,
and a jail-local
.Pa /dev ,
and
.It
IP-based jail naming and lifecycle management via
.Xr jailctl 8 .
.El
.Pp
By default,
.Nm
reads configuration from
.Pa /etc/jailmgr.conf .
A different configuration file can be selected with the
.Ev JAILMGR_CONF
environment variable.
.Pp
Most commands require superuser privileges.
.Sh COMMANDS
The following commands are supported:
.Bl -tag -width "prepare name ip"
.It Cm bootstrap
Download
.Pa base.tar.xz
and
.Pa etc.tar.xz
from
.Ev NETBSD_MIRROR
after ensuring the
.Li secmodel_jail
kernel module is loaded,
and persist
.Li secmodel_jail
in
.Pa /etc/modules.conf
for future boots.
Then
extract
.Pa base.tar.xz
into the configured shared base layer directory.
.It Cm prepare Ar name Ar ip
Create directories and metadata for one jail:
.Pa root ,
.Pa etc ,
.Pa var ,
.Pa tmp ,
.Pa home ,
and
.Pa dev .
If necessary,
.Pa etc.tar.xz
is extracted into the jail-local
.Pa etc
copy.
A jail-local shell configuration file is written to
.Pa ${JAIL_DATA_DIR}/name/jail.conf .
.It Cm host-net-up
Add host-side IPv4 aliases for all jails with a
.Pa jail.conf
on interface
.Ev JAIL_HOST_IF .
.It Cm host-net-down
Remove those host-side IPv4 aliases.
.It Cm start Ar name
Mount the composed jail root and start the jail with
.Xr jailctl 8 , using the IPv4 address stored in
.Pa jail.conf .
.It Cm start Cm --all
Run
.Cm host-net-up
and then start all jails found under
.Ev JAIL_DATA_DIR
with a
.Pa jail.conf .
.It Cm stop Ar name
Terminate the corresponding
.Xr jailctl 8
supervise process for the jail named
.Ar name ,
then destroy the jail by name through
.Xr jailctl 8
and unmount its root composition.
.It Cm stop Cm --all
Stop and unmount all jails found under
.Ev JAIL_DATA_DIR
with a
.Pa jail.conf .
.It Cm restart Ar name
Run
.Cm stop
for jail
.Ar name
and then
.Cm start
for the same jail, using the IPv4 address from
.Pa jail.conf .
.It Cm restart Cm --all
Run
.Cm stop Cm --all
followed by
.Cm start Cm --all .
.It Cm npf-sync
Generate (or update) an NPF snippet and write it to
.Ev NPF_CONF_SNIPPET .
When
.Ev NPF_NAT_ENABLE
is
.Dq YES ,
egress NAT rules are generated for each configured jail IP
.Pq one Li map rule per jail .
Additionally, redirection rules are generated from each jail's
.Ev JAIL_NPF_RDR_LIST
value in
.Pa jail.conf .
If
.Ev NPF_AUTO_RELOAD
is
.Dq YES ,
reload NPF after writing the snippet.
.It Cm status
Show
.Xr jailctl 8
status and mount status for all configured jails.
.It Cm gen-rc Op Ar path
Emit an
.Xr rc.d 8
wrapper script.
If
.Ar path
is omitted,
.Pa /etc/rc.d/jailmgr
is used.
.El
.Sh CONFIGURATION
.Nm
accepts shell-style variable assignments in
.Pa /etc/jailmgr.conf
(or the file referenced by
.Ev JAILMGR_CONF ) .
.Pp
Important variables:
.Bl -tag -width "NPF_CONF_SNIPPET"
.It Ev RELEASE
NetBSD release used for set download paths.
.It Ev MACHINE_ARCH
Machine architecture used for set download paths.
.It Ev NETBSD_MIRROR
Base URL for set downloads.
.It Ev JAIL_BASE_DIR
Directory containing extracted shared base layers.
.It Ev JAIL_DATA_DIR
Directory containing per-jail writable state.
.It Ev JAIL_RELEASE_DIR
Directory containing downloaded set archives.
.It Ev JAIL_DEFAULT_USER
User account to ensure exists inside each prepared jail.
.It Ev JAIL_SUPERVISE_CMD
Required command (with optional arguments) passed to
.Xr jailctl 8
.Cm supervise
after jail creation.
Jails may override this with
.Ev JAIL_SUPERVISE_CMD_LOCAL
in their
.Pa jail.conf .
.It Ev JAIL_HOST_IF
Host interface for alias management (commonly
.Dq lo0 ) .
.It Ev JAIL_LOCAL_DEV
When set to
.Dq YES
(default), mount a jail-local tmpfs on
.Pa /dev
and populate a minimal device set with
.Xr MAKEDEV 8 .
.It Ev JAIL_DEV_SIZE
Size argument used for the tmpfs mounted at jail-local
.Pa /dev
(default
.Dq 8m ) .
.It Ev JAIL_DEVICES
Whitespace-separated list of
.Xr MAKEDEV 8
targets used to populate jail-local
.Pa /dev .
.It Ev NPF_ENABLE
Enable NPF integration when set to
.Dq YES .
.It Ev NPF_EXT_IF
External interface name used in generated
.Nm npf-sync
rules.
.It Ev NPF_CONF_SNIPPET
Path of generated NPF rule snippet.
.It Ev NPF_AUTO_RELOAD
Reload NPF after snippet updates when set to
.Dq YES .
.It Ev NPF_NAT_ENABLE
When set to
.Dq YES
(default),
.Nm npf-sync
adds per-jail egress NAT rules of the form:
.Dq Li map on $NPF_EXT_IF inet from $JAIL_IPV4/32 to any -> ($NPF_EXT_IF) .
Set to
.Dq NO
to disable NAT rule generation.
.It Ev JAIL_NPF_RDR_LIST
Per-jail forwarding entries stored in each jail's
.Pa jail.conf ,
using a whitespace-separated list of
.Dq host_port:jail_port
pairs.
These entries are consumed by
.Cm npf-sync
to generate
.Li rdr
rules for that jail's
.Ev JAIL_IPV4
address.
.El
.Sh FILES
.Bl -tag -width "/usr/share/examples/jailmgr/jailmgr.conf.sample"
.It Pa /etc/jailmgr.conf
Default configuration file.
.It Pa /usr/share/examples/jailmgr/jailmgr.conf.sample
Sample configuration file.
.It Pa /usr/share/examples/jailmgr/README
Operational notes and quick-start guidance.
.El
.Sh EXAMPLES
Prepare and start all configured jails:
.Bd -literal -offset indent
# cp /usr/share/examples/jailmgr/jailmgr.conf.sample /etc/jailmgr.conf
# vi /etc/jailmgr.conf
# jailmgr bootstrap
# jailmgr prepare jail1 10.0.0.1
# jailmgr prepare jail2 10.0.0.2
# jailmgr start --all
.Ed
.Pp
Generate NPF rules for configured port forwards:
.Bd -literal -offset indent
# jailmgr npf-sync
# echo "include \"/etc/npf-jailmgr.conf\"" >> /etc/npf.conf
# npfctl reload
.Ed
.Sh SEE ALSO
.Xr jailctl 8 ,
.Xr mount_null 8 ,
.Xr npf.conf 5 ,
.Xr rc.d 8
.Sh HISTORY
The
.Nm
script appeared in
.Nx 10.0 .
This manual page was expanded when
.Nm
was moved to its own
.Pa usr.sbin/jailmgr
subdirectory.
