MatthiasPetermann/netbsd-src/usr.sbin/cellui/cellui.8
.\" $NetBSD$
.\"-
.\" Copyright (c) 2026 Matthias Petermann
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"-
.Dd March 13, 2026
.Dt CELLUI 8
.Os
.Sh NAME
.Nm cellui
.Nd interactive terminal UI for managing cellman cells and storage backups
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
utility provides an interactive
.Xr curses 3
interface for operating cells managed by
.Xr cellman 8 .
It shows configured and running cells in a table (including cell age),
displays per-cell details including cell state labels from
.Xr cellman 8
(managed, parked, pending, declared, orphaned), create policy profile,
reserved ports, and supervise rlimits, and allows common lifecycle actions
from the keyboard.
.Pp
Two modes are available:
.Dq cell management
and
.Dq storage management .
Press
.Cm TAB
to switch between modes.
Storage mode lists volumes and per-cell overlays, displays backups for the
selected storage target, and lets you create or restore backups interactively.
.Pp
By default,
.Nm
refreshes its view every 4 seconds.
.Pp
Cell status data is loaded from
.Cm "cellman cell list --view merged -T -H -o ..." .
Storage status data is loaded from
.Cm "cellman volume list --view merged -T -H -o ..." .
Overlay status data is loaded from
.Cm "cellman cell list --view merged -T -H -o ..." .
Backup inventory is loaded from
.Cm "cellman volume backup list <name> -T -H"
and
.Cm "cellman cell backup list <name> -T -H" .
If runtime TSV output is malformed or schema-incompatible,
.Nm
surfaces this as a refresh error instead of silently skipping rows.
.Pp
Cell state semantics are taken directly from
.Cm cellman
state labels in the detail panel.
.Pp
The selected theme is persisted per user in
.Pa ~/.celluirc
and loaded on startup when available.
The file format is
.Dq theme=<name> .
If no theme is set in
.Pa ~/.celluirc ,
the default theme is
.Dq sysinst .
.Sh KEY BINDINGS
The following keys are available:
.Bl -tag -width "enter"
.It Cm TAB
Switch between cell mode and storage mode.
.It Cm q , Ctrl-C
Quit.
.It Cm m
Rotate color theme.
.It Cm j , Cm k , KEY_UP , KEY_DOWN
Move selection down or up.
.It KEY_PPAGE , KEY_NPAGE
Move one page up or down.
.El
.Pp
Cell mode:
.Bl -tag -width "enter"
.It Cm j , Cm k , KEY_UP , KEY_DOWN
Move selection down or up.
.It KEY_PPAGE , KEY_NPAGE
Move one page up or down.
.It Cm r
Refresh immediately.
.It Cm f
Cycle filter mode:
.Dq all ,
.Dq running ,
or
.Dq stopped .
.It Cm enter
Open an interactive shell inside the selected cell using
.Cm "cellman cell shell" .
This is only available for running cells.
.It Cm s , Cm x , Cm t
Start, stop, or restart the selected cell using
.Cm "cellman cell start" ,
.Cm "cellman cell stop" ,
and
.Cm "cellman cell restart" .
.It Cm a , Cm z , Cm y
Start all, stop all, or restart all configured cells using
.Cm "--all" .
.It Cm A
Run
.Cm "cellman apply --all"
to apply declarative manifests to runtime state.
.El
.Pp
Storage mode:
.Bl -tag -width "enter"
.It Cm R
Refresh immediately.
.It Cm [ , Cm ] , KEY_LEFT , KEY_RIGHT
Select previous or next backup of the currently selected storage target.
.It Cm b
Create a backup for the selected target using
.Cm "cellman volume backup create"
or
.Cm "cellman cell backup create" .
.It Cm r
Prepare restore of the selected backup.
.It Cm d
Prepare deletion of the selected backup.
Press
.Cm enter
to confirm restore or deletion.
Any other key cancels.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr cellman 8 ,
.Xr curses 3
.Sh HISTORY
The
.Nm
utility first appeared in an unofficial patch set for
.Nx
11.0 .
.Sh AUTHORS
.An Matthias Petermann Aq Mt mp@petermann-digital.de
