MatthiasPetermann/netbsd-src/usr.sbin/svcmgr/svcmgr.8
." $NetBSD$
."-
." Copyright (c) 2026
." The NetBSD Foundation, Inc.
." All rights reserved.
." 
." Redistribution and use in source and binary forms, with or without
." modification, are permitted provided that the following conditions
." are met:
." 1. Redistributions of source code must retain the above copyright
."    notice, this list of conditions and the following disclaimer.
." 2. Redistributions in binary form must reproduce the above copyright
."    notice, this list of conditions and the following disclaimer in the
."    documentation and/or other materials provided with the distribution.
." 
." THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
." ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
." TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
." PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
." BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
." CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
." SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
." INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
." CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
." ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
." POSSIBILITY OF SUCH DAMAGE.
."-
.Dd February 23, 2026
.Dt SVCMGR 8
.Os
.Sh NAME
.Nm svcmgr
.Nd lightweight multi-service launcher for one supervised cell entrypoint
.Sh SYNOPSIS
.Nm
.Op Fl c Ar config
.Sh DESCRIPTION
The
.Nm
utility starts multiple services in parallel from a single configuration file
and forwards each child process output line-by-line with a service tag prefix.
It is designed for cell environments where one host-level supervisor command
is preferred, while still allowing multiple tightly coupled processes inside
that cell.
.Pp
This model keeps host-side orchestration simple
.Pq one supervise command per cell
while preserving per-service log classification in the shared output stream.
.Pp
The options are as follows:
.Bl -tag -width "-c config"
.It Fl c Ar config
Read service definitions from
.Ar config
instead of
.Pa /etc/svcmgr.conf .
.El
.Pp
Each non-empty, non-comment line in the configuration file has this form:
.Pp
.Dl logtag command [args ...]
.Pp
The first token is the log tag. One or more spaces and/or tabs separate
log tag and command. The rest of the line is executed via
.Pa /bin/sh -c .
.Pp
For every line,
.Nm
starts one child process and captures both stdout and stderr.
Output is buffered per stream until a full newline is received; each emitted
line is prefixed with the service log tag and then flushed immediately.
This avoids fragmented partial lines in outer supervisors.
.Pp
On
.Dv SIGTERM ,
.Dv SIGINT ,
or
.Dv SIGQUIT ,
.Nm
forwards
.Dv SIGTERM
to all running child process groups, waits 5 seconds, then sends
.Dv SIGKILL
to any remaining processes.
.Sh FILES
.Bl -tag -width /usr/share/examples/svcmgr/svcmgr.conf.sample
.It Pa /etc/svcmgr.conf
Default service list.
.It Pa /usr/share/examples/svcmgr/svcmgr.conf.sample
Example configuration file.
.El
.Sh EXAMPLES
Sample
.Pa /etc/svcmgr.conf :
.Bd -literal -offset indent
site1 /usr/libexec/httpd -I 8080 -X -f -s /var/www/site1
site2 /usr/libexec/httpd -I 8081 -X -f -s /var/www/site2
.Ed
.Sh SEE ALSO
.Xr cellctl 8 ,
.Xr cellmgr 8 ,
.Xr sh 1
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 10.1 .
.Sh AUTHORS
.An Matthias Petermann Aq Mt mp@petermann-digital.de
