MatthiasPetermann/netbsd-src/usr.sbin/cellmgr/cellmgr.8
." $NetBSD$
.Dd March 13, 2026
.Dt CELLMGR 8
.Os
.Sh NAME
.Nm cellmgr
.Nd unified declarative and runtime control plane for cells, overlays, and volumes
.Sh SYNOPSIS
.Nm
.Cm system
.Cm bootstrap
.Op Cm --xbase
.Nm
.Cm ipc
.Cm serve
.Op Cm --stdio
.Nm
.Cm cell
.Cm list
.Op Cm --view Ar merged|desired|runtime
.Op Fl o Ar fields
.Op Fl T
.Op Fl H
.Nm
.Cm cell
.Cm show
.Ar name
.Op Cm --view Ar merged|desired|runtime
.Op Fl o Ar fields
.Op Fl T
.Op Fl H
.Nm
.Cm cell
.Cm fields
.Op Cm --view Ar merged|desired|runtime
.Op Fl T
.Op Fl H
.Nm
.Cm cell
.Cm create
.Ar name
.Op Cm --autostart Ar YES|NO
.Cm --cmd Ar command
.Op Cm --profile Ar low|medium|high
.Op Cm --reserved-ports Ar port[,port...]
.Op Cm --rlimit-nofile Ar n|unlimited
.Op Cm --rlimit-as Ar bytes|unlimited
.Op Cm --rlimit-core Ar bytes|unlimited
.Op Cm --depends-on Ar dep[,dep...]
.Op Cm --healthcheck Ar command
.Op Cm --mount Ar volume:/target[:ro|rw]
.Op Cm --log-facility Ar facility
.Op Cm --stdout-level Ar level
.Op Cm --stderr-level Ar level
.Op Cm --log-tag Ar tag
.Op Cm --scope Ar desired|both
.Nm
.Cm cell
.Cm set
.Ar name
.Op Cm --autostart Ar YES|NO
.Op Cm --cmd Ar command
.Op Cm --profile Ar low|medium|high
.Op Cm --reserved-ports Ar port[,port...]
.Op Cm --rlimit-nofile Ar n|unlimited
.Op Cm --rlimit-as Ar bytes|unlimited
.Op Cm --rlimit-core Ar bytes|unlimited
.Op Cm --depends-on Ar dep[,dep...]
.Op Cm --healthcheck Ar command
.Op Cm --mount Ar volume:/target[:ro|rw]
.Op Cm --log-facility Ar facility
.Op Cm --stdout-level Ar level
.Op Cm --stderr-level Ar level
.Op Cm --log-tag Ar tag
.Op Cm --clear-reserved-ports
.Op Cm --clear-rlimit-nofile
.Op Cm --clear-rlimit-as
.Op Cm --clear-rlimit-core
.Op Cm --clear-depends-on
.Op Cm --clear-healthcheck
.Op Cm --clear-mounts
.Op Cm --clear-log
.Op Cm --scope Ar desired|both
.Nm
.Cm cell
.Cm remove
.Ar name|--all|--orphans
.Op Cm --scope Ar desired|runtime|both
.Op Cm --yes
.Op Cm --force
.Nm
.Cm cell
.Cm start|stop|restart
.Ar name|--all
.Op Cm --scope Ar runtime|both
.Nm
.Cm cell
.Cm shell
.Ar name
.Nm
.Cm cell
.Cm edit
.Ar name
.Op Cm --target Ar cell|apply
.Op Cm --cell
.Op Cm --apply
.Nm
.Cm cell
.Cm backup
.Cm create
.Ar name
.Nm
.Cm cell
.Cm backup
.Cm list
.Ar name
.Op Fl T
.Op Fl H
.Nm
.Cm cell
.Cm backup
.Cm restore
.Ar name
.Op Cm --from Ar archive.tar.gz
.Op Cm --latest
.Op Cm --manifest
.Op Cm --yes
.Nm
.Cm cell
.Cm backup
.Cm delete
.Ar name
.Op Cm --from Ar archive.tar.gz
.Op Cm --latest
.Op Cm --yes
.Nm
.Cm cell
.Cm plan
.Cm run
.Ar name
.Op Cm --file Ar plan.apply
.Op Cm --ephemeral
.Nm
.Cm volume
.Cm list|show|fields
.Op Ar ...
.Nm
.Cm volume
.Cm create|set
.Ar name
.Op Fl m Ar mode
.Op Cm --scope Ar desired|both
.Nm
.Cm volume
.Cm remove
.Ar name|--all|--orphans
.Op Cm --scope Ar desired|runtime|both
.Op Cm --yes
.Nm
.Cm volume
.Cm edit
.Ar name
.Nm
.Cm volume
.Cm backup
.Cm create
.Ar name
.Nm
.Cm volume
.Cm backup
.Cm list
.Ar name
.Op Fl T
.Op Fl H
.Nm
.Cm volume
.Cm backup
.Cm restore
.Ar name
.Op Cm --from Ar archive.tar.gz
.Op Cm --latest
.Op Cm --manifest
.Op Cm --yes
.Nm
.Cm volume
.Cm backup
.Cm delete
.Ar name
.Op Cm --from Ar archive.tar.gz
.Op Cm --latest
.Op Cm --yes
.Nm
.Cm system
.Cm reset
.Op Cm --scope Ar desired|runtime|both
.Op Cm --cells
.Op Cm --volumes
.Op Cm --yes
.Nm
.Cm apply
.Op Cm --all | Ar name ...
.Op Cm --dry-run
.Op Cm --reapply
.Op Cm --restart-changed
.Op Cm --silent
.Op Fl v
.Sh DESCRIPTION
The
.Nm
utility manages desired and runtime state for cells and named volumes in one
CLI surface.
Desired state is stored in manifests under
.Pa /etc/cellmgr .
Runtime state is rendered under
.Pa /var/cellmgr .
The
.Cm apply
command reconciles desired state into runtime state.
.Pp
Within each runtime cell root,
.Pa /.overlay
is mounted as the writable layer.
Common writable paths
.Pq Pa /etc , Pa /var , Pa /tmp , Pa /home , Pa /root , Pa /usr/pkg
resolve through that overlay.
.Pp
Storage backups are stored under
.Pa /var/backups/cellmgr/volumes
and
.Pa /var/backups/cellmgr/overlays
as
.Pa <name>_YYYYmmddHHMMSS.tar.gz .
.Pp
Cell runtime and merged views include an
.Dq age
field derived from kernel cell creation time.
For direct CLI human-readable output,
.Dq age
is rendered using compact units (for example
.Dq 42s ,
.Dq 7m12s ,
or
.Dq 3h05m )
while TSV output and IPC-routed output emit raw seconds for client-side rendering.
.Pp
Optional create-time rlimits for supervise workloads can be configured per cell
using
.Cm --rlimit-nofile ,
.Cm --rlimit-as ,
and
.Cm --rlimit-core
.Pq or the corresponding manifest variables .
When unset, supervise processes keep the system default behavior
.Pq commonly unlimited on host defaults .
.Pp
Cell and volume names follow
.Dq [A-Za-z0-9._-] .
.Pp
Read commands support unified output flags:
.Bl -tag -width "--view merged|desired|runtime"
.It Cm --view Ar merged|desired|runtime
Select projection scope for
.Cm list ,
.Cm show ,
and
.Cm fields .
Default is
.Dq merged .
.It Fl o Ar fields
Select fields as comma-separated tokens in output order.
.It Fl T
Emit stable TSV output.
.It Fl H
Omit the TSV header line
.Pq requires Fl T .
.El
.Pp
Mutating commands support
.Cm --scope
to control the effect domain:
.Bl -tag -width "--scope desired|runtime|both"
.It Cm --scope Ar desired
Change desired state only.
.It Cm --scope Ar runtime
Change runtime state only.
.It Cm --scope Ar both
Apply both desired and runtime effects.
.El
.Sh COMMANDS
.Bl -tag -width "cell remove name --scope desired|runtime|both"
.It Cm system Cm bootstrap Op Cm --xbase
Prepare system prerequisites, fetch sets, and build shared base layer.
.It Cm ipc Cm serve Op Cm --stdio
Start the stdio message endpoint for long-lived clients.
The command reads framed requests from standard input and writes framed
responses to standard output.
This command does not require root by itself, but dispatched subcommands keep
their existing privilege requirements.
.It Cm cell Cm list Op Ar output-options
List cells from the selected
.Cm --view .
Default output is a human-readable table.
.It Cm cell Cm show Ar name Op Ar output-options
Show one cell row from the selected
.Cm --view .
.It Cm cell Cm fields Op Ar output-options
List supported field names for the selected
.Cm --view .
.It Cm cell Cm create Ar name Op Ar cell-options
Create desired cell manifests.
With
.Cm --scope both ,
run targeted convergence for the created cell.
At runtime render time, host
.Pa /etc/resolv.conf
and
.Pa /etc/localtime
are copied into the cell
.Pa /etc
overlay to seed DNS and timezone defaults.
.It Cm cell Cm set Ar name Op Ar cell-options
Update desired cell manifest values.
With
.Cm --scope both ,
run targeted convergence for the updated cell.
.It Cm cell Cm remove Ar name|--all|--orphans Op Ar remove-options
Remove desired and/or runtime cell state according to
.Cm --scope .
Destructive
.Cm --all
and
.Cm --orphans
operations require interactive confirmation or
.Cm --yes .
.It Cm cell Cm start|stop|restart Ar name|--all Op Cm --scope Ar runtime|both
Perform runtime lifecycle actions.
With
.Cm --scope both
for
.Cm start
and
.Cm stop ,
desired autostart is updated to match intent.
.It Cm cell Cm shell Ar name
Open an interactive shell in a running cell.
.It Cm cell Cm edit Ar name Op Cm --target Ar cell|apply Op Cm --cell Op Cm --apply
Open one declarative cell file in an editor.
By default, edits
.Pa /etc/cellmgr/<name>.cell .
Use
.Cm --target apply
or
.Cm --apply
to edit
.Pa /etc/cellmgr/<name>.apply .
.It Cm cell Cm backup Cm create Ar name
Create a compressed backup archive of a cell runtime overlay.
The cell must be stopped.
.It Cm cell Cm backup Cm list Ar name Op Fl T Op Fl H
List backup archives for one cell overlay, newest first.
.It Cm cell Cm backup Cm restore Ar name Op Cm --from Ar archive.tar.gz Op Cm --latest Op Cm --manifest Op Cm --yes
Restore runtime overlay content from a backup archive.
The cell must be stopped.
With
.Cm --manifest ,
restore associated
.Pa /etc/cellmgr/<name>.cell
and
.Pa /etc/cellmgr/<name>.apply
snapshots when available.
.It Cm cell Cm backup Cm delete Ar name Op Cm --from Ar archive.tar.gz Op Cm --latest Op Cm --yes
Delete one backup archive for a cell overlay.
.It Cm cell Cm plan Cm run Ar name Op Cm --file Ar plan.apply Op Cm --ephemeral
Run one declarative apply plan for a cell.
Without
.Cm --file ,
the default
.Pa /etc/cellmgr/<name>.apply
is used.
.It Cm volume Cm list|show|fields Op Ar output-options
Read volume state with the same
.Cm --view/-o/-T/-H
contract used by cell read commands.
.It Cm volume Cm create|set Ar name Op Fl m Ar mode Op Cm --scope Ar desired|both
Create or update desired volume manifest values.
With
.Cm --scope both ,
materialize runtime volume path from desired state.
.It Cm volume Cm edit Ar name
Open
.Pa /etc/cellmgr/<name>.volume
in an editor.
.It Cm volume Cm remove Ar name|--all|--orphans Op Ar remove-options
Remove desired and/or runtime volume state according to
.Cm --scope .
.It Cm volume Cm backup Cm create Ar name
Create a compressed backup archive of the runtime volume directory.
.It Cm volume Cm backup Cm list Ar name Op Fl T Op Fl H
List backup archives for one volume, newest first.
.It Cm volume Cm backup Cm restore Ar name Op Cm --from Ar archive.tar.gz Op Cm --latest Op Cm --manifest Op Cm --yes
Restore runtime volume content from a backup archive.
Without
.Cm --from ,
the latest matching backup is selected automatically.
With
.Cm --manifest ,
restore the associated
.Pa /etc/cellmgr/<name>.volume
snapshot when available.
.It Cm volume Cm backup Cm delete Ar name Op Cm --from Ar archive.tar.gz Op Cm --latest Op Cm --yes
Delete one backup archive for a volume.
Without
.Cm --from ,
the latest matching backup is selected automatically.
.It Cm system Cm reset Op Cm --scope Ar desired|runtime|both Op Cm --cells Op Cm --volumes Op Cm --yes
Reset selected resource groups by chaining destructive
.Cm --all
operations for cells and/or volumes.
When neither
.Cm --cells
nor
.Cm --volumes
is specified, both are reset.
.It Cm apply Op Cm --all | Ar name ... Op Cm --dry-run Op Cm --reapply Op Cm --restart-changed Op Cm --silent Op Fl v
Reconcile desired state to runtime state.
With
.Cm --dry-run ,
print the plan only and return exit status 2 when changes would be required.
.El
.Sh IPC PROTOCOL
The
.Cm ipc serve --stdio
endpoint uses framed messages on stdin/stdout.
Each message starts with an ASCII header line:
.Bd -literal -offset indent
M 1 <TYPE> <ID> <P1> <P2> <P3> <LEN>\n
.Ed
followed by exactly
.Ar LEN
payload bytes.
.Pp
Supported message types are:
.Bl -tag -width "CALL"
.It HELLO
Handshake frame.
.It CALL
Execute a CLI request.
.Ar P1
is mode (0=capture, 1=interactive tty),
.Ar P2
is argv count.
.Ar P3
is an environment override flag (0=none, 1=payload starts with key/value lines).
Payload is newline-delimited text entries.
When
.Ar P3
is 1, the payload starts with
.Dq env_key
and
.Dq env_value
lines followed by argv entries.
Arguments and optional environment values must not contain literal newline
bytes.
.It RET
Command response.
.Ar P1
is exit status,
.Ar P2
and
.Ar P3
are stdout/stderr byte counts.
Payload is stdout bytes followed by stderr bytes.
.It ERR
Protocol/server error.
.Ar P1
is an error code.
.It PING , PONG , BYE
Keepalive and shutdown control frames.
.El
.Pp
Maximum accepted payload size is 64 MiB.
.Sh EXIT STATUS
.Bl -tag -width Ds
.It 0
Success.
.It 1
Failure.
.It 2
Only for
.Cm apply --dry-run :
changes would be required.
.El
.Sh FILES
.Bl -tag -width /usr/share/examples/cellmgr/cellmgr.conf.sample
.It Pa /etc/cellmgr.conf
Global defaults.
.It Pa /etc/cellmgr
Desired manifests
.Pq Pa *.cell , Pa *.apply , Pa *.volume .
.It Pa /var/cellmgr/cells
Rendered runtime cell tree.
.It Pa /var/cellmgr/cells/*/overlay
Per-cell writable runtime overlay, mounted in-cell at
.Pa /.overlay .
.It Pa /var/cellmgr/volumes
Runtime volume directories.
.It Pa /var/backups/cellmgr/volumes
Volume backup archives.
.It Pa /var/backups/cellmgr/overlays
Overlay backup archives.
.It Pa /usr/share/examples/cellmgr/cellmgr.conf.sample
Sample configuration.
.El
.Sh SEE ALSO
.Xr cellctl 8 ,
.Xr secmodel_cell 9
.Sh HISTORY
The
.Nm
utility first appeared in an unofficial patch set for
.Nx
11.0 .
.Sh AUTHORS
.An Matthias Petermann Aq Mt mp@petermann-digital.de
