MatthiasPetermann/netbsd-src/share/man/man9/secmodel_cell.9
.\" $NetBSD$
.\"-
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.
.Dd March 1, 2026
.Dt SECMODEL_CELL 9
.Os
.Sh NAME
.Nm secmodel_cell
.Nd cell security model with kauth isolation and snapshot telemetry
.Sh DESCRIPTION
.Nm
implements a cell-oriented security model on top of
.Xr kauth 9 .
Processes are associated with a cell identifier stored in credential-specific
state.
Host root
.Pq effective uid 0 in cell id 0
is privileged to manage cell membership and cell definitions.
.Pp
The model creates and manages entries under
.Xr sysctl 7
in
.Dv security.models.cell .
These controls are intended for host-root administration.
.Sh SYSCTL INTERFACE
The following nodes are created under
.Dv security.models.cell :
.Bl -tag -width create
.It Va id
Read the current process cell id, or write a cell id to request entry to that
cell.
.It Va create
Create a new cell id.
The write side accepts a
.Vt struct cell_create
request only.
Callers provide cell metadata and optional settings, including:
.Bl -tag -width CELL_CREATE_PROFILE
.It Dv CELL_CREATE_PROFILE
Select one of the supported policy profiles
.Po low, medium, high .Pc .
.It Dv CELL_CREATE_PORTS
Reserve one or more listening ports for this cell.
When at least one cell reserves a port, bind attempts for that port are
allowed only from members of the cell that reserved it.
.El
.It Va destroy
Destroy a cell id that has no remaining process members.
.It Va list
Read-only list of active cell ids and reference counts.
Access is restricted to host root.
.El
.Sh SNAPSHOT METRICS DESIGN
.Nm
exports periodic snapshot metrics per cell
.Pq process count, membership references, sampled virtual-memory size, and CPU tick window metrics .
These metrics are observation-only and are intended for operational reporting
via userland tools such as
.Xr cellctl 8 .
All values are gauge-style snapshots.
CPU metrics are exported as per-second deltas plus a rolling 10-second
average, both derived from sampled process tick counters.
.Sh OPERATIONAL LOGGING
.Nm
emits concise kernel log entries for high-value lifecycle events:
module load/unload and successful cell create/destroy operations.
These messages are intended to help administrators correlate policy and
management actions during incident analysis without excessive noise.

.Sh SEE ALSO
.Xr kauth 9 ,
.Xr secmodel 9 ,
.Xr secmodel_bsd44 9 ,
.Xr secmodel_extensions 9 ,
.Xr secmodel_overlay 9 ,
.Xr secmodel_securelevel 9 ,
.Xr secmodel_suser 9 ,
.Xr sysctl 7
.Sh HISTORY
The
.Nm
security model first appeared as a prototype patch for
.Nx 10.1 .
.Sh AUTHORS
.An Matthias Petermann Aq Mt mp@petermann-digital.de
