MatthiasPetermann/netbsd-src/share/man/man9/secmodel_jail.9
.\" $NetBSD$
.\"-
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.
.Dd February 8, 2026
.Dt SECMODEL_JAIL 9
.Os
.Sh NAME
.Nm secmodel_jail
.Nd jail security model with per-jail visibility and resource policies
.Sh DESCRIPTION
.Nm
implements a jail-oriented security model on top of
.Xr kauth 9 .
Processes are associated with a jail identifier stored in credential-specific
state.
Host root
.Pq effective uid 0 in jail id 0
is privileged to manage jail membership and jail definitions.
.Pp
The model creates and manages entries under
.Xr sysctl 7
in
.Dv security.models.jail .
These controls are intended for host-root administration.
.Sh SYSCTL INTERFACE
The following nodes are created under
.Dv security.models.jail :
.Bl -tag -width resource_mode
.It Va id
Read the current process jail id, or write a jail id to request entry to that
jail.
.It Va create
Create a new jail id.
The write side accepts either a legacy integer form or a
.Vt struct jail_create
request.
.It Va destroy
Destroy a jail id that has no remaining process members.
.It Va list
Read-only list of active jail ids and reference counts.
.It Va resource_mode
Selects how configured jail CPU/memory limits are enforced:
.Bl -tag -width 0xN
.It 0
Per-process
.Xr setrlimit 2
style enforcement
.Pq RLIMIT mode .
When a process enters a jail, configured limits are applied via
.Dv RLIMIT_CPU
and
.Dv RLIMIT_AS
for that process.
Because
.Dv RLIMIT_CPU
is second-granular, CPU limits configured in milliseconds are rounded up to
the next whole second when translated for this mode.
.It 1
Aggregate per-jail enforcement.
The model computes jail-wide usage by summing per-process accounting, and
rejects operations that would exceed configured limits.
In this mode, CPU over-limit handling is admission-oriented: jail entry and
fork checks are denied when over limit, but already running members are not
asynchronously signalled by aggregate CPU policy.
.El
.El
.Pp
The default is aggregate mode.
.Sh MODE TRANSITIONS
Changing
.Va resource_mode
affects subsequent policy decisions.
It does not retroactively rewrite existing per-process
.Dv RLIMIT_CPU
or
.Dv RLIMIT_AS
values for processes that are already running.
.Pp
Operationally, this means that switching to RLIMIT mode influences processes
as they enter a jail under that mode, while switching to aggregate mode causes
future fork/enter and memory-growth checks to use jail-wide accounting.
.Sh RESOURCE ENFORCEMENT DESIGN
.Nm
supports two complementary enforcement paths:
.Bl -enum
.It
Process-scope checks via
.Xr kauth 9
listeners.
In aggregate mode, fork and jail-entry checks can be denied when the target
jail is already at or above configured limits.
For CPU limits specifically, this is an admission check and not a runtime
preemption mechanism for already-running jail members.
.It
Memory-growth checks via a UVM callback hook.
.Nm
installs an optional callback consulted by UVM growth paths
.Po e.g.,
.Xr mmap 2 ,
.Xr brk 2 ,
and automatic stack growth
.Pc .
If the callback reports that a requested growth would exceed the jail memory
limit, the operation fails with
.Er ENOMEM .
.El
.Pp
The UVM hook is intentionally generic: UVM provides call sites while
.Nm
provides policy.
.Sh OPERATIONAL LOGGING
.Nm
emits concise kernel log entries for high-value lifecycle events:
module load/unload and successful jail create/destroy operations.
In addition, when resource policy vetoes an operation
.Po
for example, fork/enter denial in aggregate mode or memory-growth denial
.Pc ,
it emits a rate-limited informational message so administrators can identify
resource-pressure decisions in failure analysis.
These messages are intended to help administrators correlate policy and
resource-management actions during incident analysis without excessive noise.
.Sh SEE ALSO
.Xr kauth 9 ,
.Xr secmodel 9 ,
.Xr secmodel_bsd44 9 ,
.Xr secmodel_extensions 9 ,
.Xr secmodel_overlay 9 ,
.Xr secmodel_securelevel 9 ,
.Xr secmodel_suser 9 ,
.Xr sysctl 7
.Sh AUTHORS
.An The NetBSD Foundation, Inc.
