MatthiasPetermann/netbsd-src/share/man/man9/secmodel_jail.9
.\" $NetBSD$
.\"-
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.
.Dd February 20, 2026
.Dt SECMODEL_JAIL 9
.Os
.Sh NAME
.Nm secmodel_jail
.Nd jail security model with per-jail visibility and policy controls
.Sh DESCRIPTION
.Nm
implements a jail-oriented security model on top of
.Xr kauth 9 .
Processes are associated with a jail identifier stored in credential-specific
state.
Host root
.Pq effective uid 0 in jail id 0
is privileged to manage jail membership and jail definitions.
.Pp
The model creates and manages entries under
.Xr sysctl 7
in
.Dv security.models.jail .
These controls are intended for host-root administration.
.Sh SYSCTL INTERFACE
The following nodes are created under
.Dv security.models.jail :
.Bl -tag -width create
.It Va id
Read the current process jail id, or write a jail id to request entry to that
jail.
.It Va create
Create a new jail id.
The write side accepts either a legacy integer form or a
.Vt struct jail_create
request.
.Pp
In the legacy form, writing an integer creates a jail id with default policy.
In the structured form, callers provide jail metadata and optional settings,
including:
.Bl -tag -width JAIL_CREATE_MEMLIMIT
.It Dv JAIL_CREATE_MEMLIMIT
Set a per-process address-space limit for processes that enter the jail.
.It Dv JAIL_CREATE_CPULIMIT
Set a per-process CPU-time limit for processes that enter the jail.
.It Dv JAIL_CREATE_PROFILE
Select one of the supported policy profiles
.Po low, medium, high .Pc .
.It Dv JAIL_CREATE_PORTS
Reserve one or more listening ports for this jail.
When at least one jail reserves a port, bind attempts for that port are
allowed only from members of the jail that reserved it.
.El
.It Va destroy
Destroy a jail id that has no remaining process members.
.It Va list
Read-only list of active jail ids and reference counts.
.El
.Sh RESOURCE ENFORCEMENT DESIGN
.Nm
enforces jail-scoped admission checks for memory growth, process creation,
file-descriptor allocation, and socket-buffer charging.
CPU control is tracked per jail using quota/period windows and throttle state.
This implementation is jail-native and not translated through
.Xr setrlimit 2
as the primary control path.
.Sh OPERATIONAL LOGGING
.Nm
emits concise kernel log entries for high-value lifecycle events:
module load/unload and successful jail create/destroy operations.
These messages are intended to help administrators correlate policy and
management actions during incident analysis without excessive noise.
.Sh NOTES
CPU quota enforcement is currently admission-oriented:
run-queue selection skips jailed LWPs while a jail is over quota,
and fork admission is denied in the same state.
The implementation does not provide strict proportional CPU partitioning or
hard real-time style guarantees across jails.

.Sh SEE ALSO
.Xr kauth 9 ,
.Xr secmodel 9 ,
.Xr secmodel_bsd44 9 ,
.Xr secmodel_extensions 9 ,
.Xr secmodel_overlay 9 ,
.Xr secmodel_securelevel 9 ,
.Xr secmodel_suser 9 ,
.Xr sysctl 7
.Sh HISTORY
The
.Nm
security model first appeared as a prototype patch for
.Nx 10.1 .
.Sh AUTHORS
.An Matthias Petermann Aq Mt mp@petermann-digital.de
